ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/R5SS_VIM1_50F00000h.xml
<module name="VIM1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="VIM1_PID" acronym="VIM1_PID" offset="0" width="32" description="         The Revision Register contains the major and minor revisions  for the module.   ">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="         PID register scheme     " range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="         Business Unit: 10 = Processors     " range="29:28" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x144" description="         Module ID     " range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="         RTL revision. Will vary depending on release.     " range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="         Major revision     " range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="         Custom     " range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="         Minor revision     " range="5:0" rwaccess="R"/>
	</register><register id="VIM1_INFO" acronym="VIM1_INFO" offset="4" width="32" description="         The Info Register gives the configuration Inforrmation of  this VIM.   ">
		<bitfield id="RES1" width="21" begin="31" end="11" resetval="0x0" description="          RESERVE FIELD" range="31:11" rwaccess="R"/>
	<bitfield id="INTERRUPTS" width="11" begin="10" end="0" resetval="0x256" description="         Total number of Interrupts     " range="10:0" rwaccess="R"/>
	</register><register id="VIM1_PRIIRQ" acronym="VIM1_PRIIRQ" offset="8" width="32" description="         The Prioritized IRQ Register shows the number of the highest  priority pending IRQ.   ">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="         Indicates that the num field is valid.     " range="31" rwaccess="R"/>
	<bitfield id="RES2" width="11" begin="30" end="20" resetval="0x0" description="          RESERVE FIELD" range="30:20" rwaccess="R"/>
	<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="         Priority of the highest priority pending IRQ.  valid only if  the valid flag is set.    " range="19:16" rwaccess="R"/>
	<bitfield id="RES3" width="6" begin="15" end="10" resetval="0x0" description="          RESERVE FIELD" range="15:10" rwaccess="R"/>
	<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="         Number of the highest priority pending IRQ.  valid only if  the valid flag is set.    " range="9:0" rwaccess="R"/>
	</register><register id="VIM1_PRIFIQ" acronym="VIM1_PRIFIQ" offset="12" width="32" description="         The Prioritized FIQ Register shows the number of the highest  priority pending FIQ.   ">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="         Indicates that the num field is valid.     " range="31" rwaccess="R"/>
	<bitfield id="RES4" width="11" begin="30" end="20" resetval="0x0" description="          RESERVE FIELD" range="30:20" rwaccess="R"/>
	<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="         Priority of the highest priority pending FIQ.  valid only if  the valid flag is set.    " range="19:16" rwaccess="R"/>
	<bitfield id="RES5" width="6" begin="15" end="10" resetval="0x0" description="          RESERVE FIELD" range="15:10" rwaccess="R"/>
	<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="         Number of the highest priority pending FIQ.  valid only if  the valid flag is set.    " range="9:0" rwaccess="R"/>
	</register><register id="VIM1_IRQGSTS" acronym="VIM1_IRQGSTS" offset="16" width="32" description="         The IRQ Group Status Register indicates which groups have  pending IRQ interrupts.   ">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="         Indicates that the num field is valid.     " range="31:0" rwaccess="R"/>
	</register><register id="VIM1_FIQGSTS" acronym="VIM1_FIQGSTS" offset="20" width="32" description="         The FIQ Group Status Register indicates which groups have  pending FIQ interrupts.   ">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="         Indicates that the num field is valid.     " range="31:0" rwaccess="R"/>
	</register><register id="VIM1_IRQVEC" acronym="VIM1_IRQVEC" offset="24" width="32" description="         The IRQ Vector Address Register contains the 32-bit address  of the interrupt vector for the current pendind IRQ.   ">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="         Upper 30 bits of the 32-bit vector address.  Only valid if  the Prioritized IRQ Register valid flag is true.    " range="31:2" rwaccess="R/W"/>
	<bitfield id="RES21" width="2" begin="1" end="0" resetval="0x0" description="          RESERVE FIELD" range="1:0" rwaccess="R"/>
	</register><register id="VIM1_FIQVEC" acronym="VIM1_FIQVEC" offset="28" width="32" description="         The FIQ Vector Address Register contains the 32-bit address  of the interrupt vector for the current pendind FIQ.   ">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="         Upper 30 bits of the 32-bit vector address.  Only valid if  the Prioritized FIQ Register valid flag is true.    " range="31:2" rwaccess="R/W"/>
	<bitfield id="RES22" width="2" begin="1" end="0" resetval="0x0" description="          RESERVE FIELD" range="1:0" rwaccess="R"/>
	</register><register id="VIM1_ACTIRQ" acronym="VIM1_ACTIRQ" offset="32" width="32" description="         The Active IRQ Register shows the number of the currently  active IRQ.   ">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="         Indicates that the num field is valid. Set when the IRQ  Vector Address Register is read and cleared whenever the IRQ  Vector Address Register is written.    " range="31" rwaccess="R"/>
	<bitfield id="RES6" width="11" begin="30" end="20" resetval="0x0" description="          RESERVE FIELD" range="30:20" rwaccess="R"/>
	<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="         Priority of the highest priority pending IRQ.  valid only if  the valid flag is set.    " range="19:16" rwaccess="R"/>
	<bitfield id="RES7" width="6" begin="15" end="10" resetval="0x0" description="          RESERVE FIELD" range="15:10" rwaccess="R"/>
	<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="         Number of the currently active IRQ. Loaded from teh  Prioritized IRQ Register whenever the IRQ Vector Address is  read. Valid only if the valid flag is set.    " range="9:0" rwaccess="R"/>
	</register><register id="VIM1_ACTFIQ" acronym="VIM1_ACTFIQ" offset="36" width="32" description="         The Active FIQ Register shows the number of the currently  active FIQ.   ">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="         Indicates that the num field is valid. Set when the FIQ  Vector Address Register is read and cleared whenever the FIQ  Vector Address Register is written.    " range="31" rwaccess="R"/>
	<bitfield id="RES8" width="11" begin="30" end="20" resetval="0x0" description="          RESERVE FIELD" range="30:20" rwaccess="R"/>
	<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="         Priority of the highest priority pending IRQ.  valid only if  the valid flag is set.    " range="19:16" rwaccess="R"/>
	<bitfield id="RES9" width="6" begin="15" end="10" resetval="0x0" description="          RESERVE FIELD" range="15:10" rwaccess="R"/>
	<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="         Number of the currently active FIQ. Loaded from teh  Prioritized FIQ Register whenever the FIQ Vector Address is  read. Valid only if the valid flag is set.    " range="9:0" rwaccess="R"/>
	</register><register id="VIM1_IRQPRIMSK" acronym="VIM1_IRQPRIMSK" offset="40" width="32" description="         The IRQ Priority Mask Register allows all IRQs of a particular priority to be enabled or disabled.">
		<bitfield id="RES24" width="16" begin="31" end="16" resetval="0x0" description="          RESERVE FIELD" range="31:16" rwaccess="R"/>
	<bitfield id="MSK" width="16" begin="15" end="0" resetval="0x65535" description="         Each bit corresponds to the given priority.  1 - IRQs of this priority are enabled. 0 - IRQs of this priority are disabled." range="15:0" rwaccess="R/W"/>
	</register><register id="VIM1_FIQPRIMSK" acronym="VIM1_FIQPRIMSK" offset="44" width="32" description="         The FIQ Priority Mask Register allows all FIQs of a particular priority to be enabled or disabled.">
		<bitfield id="RES24" width="16" begin="31" end="16" resetval="0x0" description="          RESERVE FIELD" range="31:16" rwaccess="R"/>
	<bitfield id="MSK" width="16" begin="15" end="0" resetval="0x65535" description="         Each bit corresponds to the given priority.  1 - FIQs of this priority are enabled. 0 - FIQs of this priority are disabled." range="15:0" rwaccess="R/W"/>
	</register><register id="VIM1_DEDVEC" acronym="VIM1_DEDVEC" offset="48" width="32" description="         The DED Vector Address contains a default vector address for  when an uncorrectable error is detected for an active IRQ or  FIQ.   ">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="         Upper 30 bits of the 32-bit vector address." range="31:2" rwaccess="R/W"/>
	<bitfield id="RES23" width="2" begin="1" end="0" resetval="0x0" description="          RESERVE FIELD" range="1:0" rwaccess="R"/>
	</register><register id="VIM1_RAW_M" acronym="VIM1_RAW_M" offset="1024" width="32" description="Group M Interrupt Raw Status/Set Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status of the events in Group M Each bit corresponds to event Q where Q = Mx32+Bit Read 0  InactiveRead 1  Active/PendingWrite 0  No effectWrite 1  Set to Interrupt Raw Status" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_STS_M" acronym="VIM1_STS_M" offset="1028" width="32" description="Group M Interrupt Enabled Status/Clear Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h .">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in Group M  Each bit corresponds to event Q where Q = Mx32+Bit Read 0  Inactive or DisabledRead 1  Active/Pending and EnabledWrite  0 No effectWrite 1 Clear Interrupt Raw Status" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_INTR_EN_SET_M" acronym="VIM1_INTR_EN_SET_M" offset="1032" width="32" description="Group M Interrupt Enabled Set Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in Group M  Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite  0 No effectWrite  1 Set Enable" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_INTER_EN_CLR_M" acronym="VIM1_INTER_EN_CLR_M" offset="1036" width="32" description="Group M Interrupt Enabled Clear Register (M is 0 to 7)Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to disable the mask of events in Group M Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite 0 No effectWrite 1 Clear Enable" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_IRQSTS_M" acronym="VIM1_IRQSTS_M" offset="1040" width="32" description="Group M Interrupt IRQ Enabled Status/Clear Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group M that are mapped to IRQ  Each bit corresponds to event Q where Q = Mx32+BitRead 0 Inactive, Disabled, or not an IRQRead 1 Active/Pending, Enabled, and IRQWrite  0 No effectWrite  1 Clear Interrupt Raw Status [if IRQ]" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_FIQSTS_M" acronym="VIM1_FIQSTS_M" offset="1044" width="32" description="Group M Interrupt FIQ Enabled Status/Clear Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group M that are mapped to FIQ  Each bit corresponds to event Q where Q = Mx32+BitRead 0 Inactive, Disabled, or not an FIQRead 1 Active/Pending, Enabled, and FIQWrite  0 No effectWrite  1 Clear Interrupt Raw Status [if FIQ]" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_INTMAP_M" acronym="VIM1_INTMAP_M" offset="1048" width="32" description="Group M Interrupt Map Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate which interrupt the corresponding event influences [if enabled] for event group M.  Each bit corresponds to event Q where Q = Mx32+Bit   0 IRQ Interrupt [default]1 FIQ Interrupt" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_INTTYPE_M" acronym="VIM1_INTTYPE_M" offset="1052" width="32" description="Group M Interrupt Type Map Register (M is 0 to 7) Address formula = 50F00000h + Offset + M x 20h.">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate whether the source of an interrupt is a level [default] or a pulse for event group M.  This is informational so that an ISR may query this register and know whether it has to clear a pulse event or a level event [see 3.4 Interrupt Handling].  The value has no effect on how the VIM hardware functions.  The input interrupts are agnostic as to whether they are pulse or level.  Each bit corresponds to event Q where Q = Mx32+Bit0  Level [default]1  Pulse" range="31:0" rwaccess="R/W"/>
	</register><register id="VIM1_INTPRIORITY_Q" acronym="VIM1_INTPRIORITY_Q" offset="4096" width="32" description="Interrupt Q Priority Register (where Q is 0 to 255) Address formula = 50F00000h + Offset + Q x 4h.">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31:4" rwaccess="R"/>
	<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority [Default]" range="3:0" rwaccess="R/W"/>
	</register><register id="VIM1_INTVECTOR_Q" acronym="VIM1_INTVECTOR_Q" offset="8192" width="32" description="Interrupt Q Vector Register (Q is 0 to 255) Address formula = 50F00000h + Offset + Q x 4h.">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="This is the 32-bit Vector Address associated with interrupt Q.  It is the address that will be reflected in the IRQ Vector Address [Base Address + 0x18] or FIQ Vector Address [Base Address + 0x1C] and the VECADDR pin when interrupt Q is the active interrupt.Internally, these values are kept in a RAM.  The FIQ and IRQ state machines have priority access to this RAM.  Writes to this register will be piped internally, but further writes to the MMR interface may be stalled until this write has a chance to complete in the RAM.  The new Vector Address will not take effect until this write completes to the RAM.  In order to tell if this write has completed, software may read this register back.  That read will not be able to complete unless the write has landed.Reads to this register will stall the MMR interface until the read is able to be completed at the RAM." range="31:2" rwaccess="R/W"/>
	<bitfield id="RES20" width="2" begin="1" end="0" resetval="0x0" description="Reserved.  Read as 0.  The lower 2 bits of the 32-bit vector address are always 0.  Vector addresses must be 32-bit aligned." range="1:0" rwaccess="R"/>
	</register>
</module>